{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "filters": 32, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_4", "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "use_bias": true, "activation": "relu", "kernel_constraint": null, "units": 256, "bias_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_2", "use_bias": true, "activation": "softmax", "kernel_constraint": null, "units": 10, "bias_regularizer": null, "trainable": true}}]}